# додаткове завдання
# рекрусивная функция которая вичисляет
# сумму натуральних чисел

def rec(n):
    if n <= 1:
        return n
    else:
        return n + rec(n - 1)

num = int(input("Enter number: "))

if num < 0:
    print("Enter a positive number")
else:
    print("The sum is", rec(num))

# ---------------------------------------------------
# ====================================================================
# Task 2
# Программа яка провіряє чи є палиндромом введена фраза

s = input("Enter word: ")

def polindrom(s):
    l = len(s)     # довжина строки
    m = ' ,-?!'    # що забрати і перевести в "" пустоту
    for j in m:
        s = s.replace(j, '')  # забирає пробел, кому, тире, знак питання і знак оклику
    s = s.lower()    # зводить все до малих букв
    for i in range(l//2):
        if s[i] != s[-1-i]:
            return "Не палиндром"
    return "Полиндром"

print(polindrom(s))

# ------------------------------------------
# Без цикла

s = input("Enter word: ")

def polindrom(s):
    l = len(s)
    m = ' ,-?!'
    for j in m:
        s = s.replace(j, '')  # забирає пробел кому тире знак питання і знак оклику
    s = s.lower()    # зводить все до малих букв
    k = s[::-1]     # перевертає строку
    if s != k:
        return "Не палиндром"
    return "Полиндром"

print(polindrom(s))

# ------------------------------------------------------------------------------------
# ===============================================================================================