# Доп. завдання.
# Создайте программу которая рисует на экране прямоугольник
# из звёздочек заданной пользователем ширины и высоты


str = int(input("Enter how many stars:"))
print("* " * str)

for i in range(str - 2):
    print("* ", "  " * (str - 3), "*")
print("* " * str)

# ------------------------------------------------------------------
# 1) Task
# Вивести сумму всех натуральнихчисел от a до b (включительно)

a = int(input("Number (a): "))
b = int(input("Number (b): "))
d = 0
for i in range(a, b + 1):
    d += i
print(d)

# ------------------------------------------------------------------


# 2)Task.
# Рахує факторіал числа який вів користувач

import math

number = int(input("Enter number: "))

print(math.factorial(number))

# ------------------------------------------------------------------


